oh-my-fish/theme-bobthefish
edc/bass
laughedelic/pisces
laughedelic/brew-completions
fisherman/z
franciscolourenco/done
fisherman/spin
sijad/gitignore
oh-my-fish/plugin-python
oh-my-fish/plugin-ssh
oh-my-fish/plugin-brew
oh-my-fish/plugin-bundler
oh-my-fish/plugin-osx
oh-my-fish/plugin-cd
barnybug/docker-fish-completion
oh-my-fish/plugin-grc
kennethreitz/fish-pipenv
oh-my-fish/plugin-virtualfish
